abourdim/esp32-rxy/platformio/src/main.cpp
/*
 * Micro:bit Remote Builder — ESP32 firmware
 *
 * Speaks the same BLE protocol as a BBC micro:bit running the rxy
 * MakeCode template, so the unmodified web app at
 *   https://abourdim.github.io/rxy/
 * can connect to an ESP32 and drive widgets exactly as it would a micro:bit.
 *
 * Target board: ESP32-C3 Super Mini (any ESP32 family chip with BLE works).
 * Library:      NimBLE-Arduino (Library Manager → search "NimBLE-Arduino").
 *               Tested against NimBLE-Arduino 2.x.
 *
 * HOW TO USE
 * ----------
 *  1. Open the rxy web app, switch to the "Build" tab, design your remote.
 *  2. Click "📄 Code". In the generated MakeCode, find the line
 *        const CFG = "..."
 *     Copy the long base64 string.
 *  3. Paste it into LAYOUT_CFG_BASE64 below, replacing the default.
 *  4. Upload to the ESP32, then in the rxy "Play" tab click "📡 Connect"
 *     and pick "BBC micro:bit ESP32" from the chooser. Every widget type
 *     already has a working demo built into handleWidget() below (they
 *     all drive the on-board LED and print to Serial), so try your
 *     layout first — no C++ required yet.
 *  5. Once you wire up real hardware, replace the matching demo in
 *     handleWidget() with your own logic.
 *
 * PROTOCOL (reverse-audited from rxy script.js)
 * ---------------------------------------------
 *  Service:    6e400001-b5a3-f393-e0a9-e50e24dcca9e
 *  Notify:     6e400002-...   (device → app, the micro:bit "TX" characteristic)
 *  Write:      6e400003-...   (app → device, the micro:bit "RX" characteristic)
 *  Encoding:   ASCII lines, '\n' terminated. CRLF tolerated.
 *  App → ESP:  "SET <id> <val>"   or   "GETCFG"
 *  ESP → App:  "UPD <id> <val>"
 *              "CFGBEGIN" / "CFG <chunk>"... / "CFGEND"
 *
 *  Note: the role of characteristics 0002 / 0003 is the OPPOSITE of the
 *  Nordic UART Service convention used by Adafruit/Bluefruit. We follow the
 *  micro:bit's convention here because the web app expects it.
 */

#include <Arduino.h>
#include <NimBLEDevice.h>
#include <esp_system.h>
#include <esp_chip_info.h>
#include <esp_idf_version.h>

// =====================================================================
//  CONFIGURATION  —  edit this section for your project
// =====================================================================

// Advertised BLE name. MUST start with "BBC micro:bit" or the rxy app
// will not show this device in the connection chooser. The name is short
// on purpose: BLE advertisement packets are only 31 bytes, and combined
// with the 128-bit UART service UUID the budget is tight. Anything longer
// gets silently dropped by some BLE stacks. The rxy filter is a
// namePrefix match, so this exact string qualifies.
static const char* BLE_DEVICE_NAME = "BBC micro:bit";

// Paste the base64 layout string from the rxy "📄 Code" button here.
// The default below is a minimal layout with a single "Test" button.
static const char* LAYOUT_CFG_BASE64 =
  "eyJ0aXRsZSI6Ik15IFJlbW90ZSIsIndpZGdldHMiOlt7ImlkIjoiYnRuX3Rlc3"
  "QiLCJ0IjoiYnV0dG9uIiwieCI6NTAsInkiOjUwLCJ3IjoxMDAsImgiOjEwMCwi"
  "bGFiZWwiOiJUZXN0IiwibW9kZWwiOiJuZW8ifV19";

// On the ESP32-C3 Super Mini the on-board blue LED is wired to GPIO 8
// and is ACTIVE LOW (write LOW to turn it on). Adjust for your board.
static const int LED_PIN          = 8;
static const int LED_ON           = LOW;
static const int LED_OFF          = HIGH;

// Debug button — when pressed, dumps the current LAYOUT_CFG_BASE64 to
// Serial in the same "CFGBEGIN / CFG <18-char> / CFGEND" framing that
// is sent over BLE. Useful to confirm visually that the layout you
// pasted is what is actually running, without needing a BLE connect.
//
// Defaults to GPIO 9 because that is the on-board BOOT button on the
// ESP32-C3 Super Mini — no extra wiring needed. CAVEAT: GPIO 9 is also
// the C3's BOOT strapping pin. Holding this button while the board is
// powering on / resetting will boot the chip into ROM download mode
// (firmware will not run). It is safe to press AFTER boot completes.
// If you want a separate dedicated debug button without that gotcha,
// wire one between GPIO 0 and GND and change BUTTON_PIN to 0.
static const int BUTTON_PIN       = 9;
static const int BUTTON_ACTIVE    = LOW;

// =====================================================================
//  BLE UUIDs  —  DO NOT CHANGE (these are the micro:bit's UART service)
// =====================================================================
#define UART_SERVICE_UUID   "6e400001-b5a3-f393-e0a9-e50e24dcca9e"
#define UART_TX_CHAR_UUID   "6e400002-b5a3-f393-e0a9-e50e24dcca9e"  // notify
#define UART_RX_CHAR_UUID   "6e400003-b5a3-f393-e0a9-e50e24dcca9e"  // write

// =====================================================================
//  State
// =====================================================================
static NimBLECharacteristic* gTxChar    = nullptr;
static volatile bool         gConnected = false;
static String                gRxBuffer;

// Forward declarations
static void handleLine(const String& line);
static void handleWidget(const String& id, const String& val);
static void sendLine(const String& line);
static void sendCfg();

/**
 * Send "UPD <id> <val>" to the app. Use this to update output widgets
 * like LEDs, labels, gauges, graphs, and battery indicators.
 */
static inline void sendValue(const String& id, const String& val) {
  sendLine("UPD " + id + " " + val);
}

// =====================================================================
//  BLE callbacks
// =====================================================================
class ServerCallbacks : public NimBLEServerCallbacks {
  void onConnect(NimBLEServer* /*server*/, NimBLEConnInfo& info) override {
    gConnected = true;
    gRxBuffer  = "";
    Serial.printf("[BLE] Client connected  peer=%s\n",
                  info.getAddress().toString().c_str());
  }
  void onDisconnect(NimBLEServer* /*server*/, NimBLEConnInfo& /*info*/, int reason) override {
    gConnected = false;
    Serial.printf("[BLE] Client disconnected (reason 0x%02x) — re-advertising\n", reason);
    NimBLEDevice::startAdvertising();
  }
  void onMTUChange(uint16_t mtu, NimBLEConnInfo& /*info*/) override {
    Serial.printf("[BLE] MTU negotiated: %u\n", mtu);
  }
};

// Human-readable name for an ESP reset reason code.
static const char* resetReasonStr(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_POWERON:   return "POWERON";
    case ESP_RST_EXT:       return "EXT (external pin)";
    case ESP_RST_SW:        return "SW (esp_restart)";
    case ESP_RST_PANIC:     return "PANIC (exception/crash)";
    case ESP_RST_INT_WDT:   return "INT_WDT (interrupt watchdog)";
    case ESP_RST_TASK_WDT:  return "TASK_WDT (task watchdog)";
    case ESP_RST_WDT:       return "WDT (other watchdog)";
    case ESP_RST_DEEPSLEEP: return "DEEPSLEEP wakeup";
    case ESP_RST_BROWNOUT:  return "BROWNOUT";
    case ESP_RST_SDIO:      return "SDIO";
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    // ESP_RST_USB / ESP_RST_JTAG were added to esp_reset_reason_t in IDF 5.0;
    // older IDF (e.g. arduino-esp32 2.0.9 on IDF 4.4) doesn't declare them.
    case ESP_RST_USB:       return "USB host reset";
    case ESP_RST_JTAG:      return "JTAG";
#endif
    default:                return "UNKNOWN";
  }
}

class RxCallbacks : public NimBLECharacteristicCallbacks {
  void onWrite(NimBLECharacteristic* chr, NimBLEConnInfo& /*info*/) override {
    std::string v = chr->getValue();
    for (size_t i = 0; i < v.size(); ++i) {
      const char c = v[i];
      if (c == '\r') continue;
      if (c == '\n') {
        if (gRxBuffer.length() > 0) {
          handleLine(gRxBuffer);
          gRxBuffer = "";
        }
      } else {
        gRxBuffer += c;
        if (gRxBuffer.length() > 256) gRxBuffer = "";  // overflow guard
      }
    }
  }
};

// =====================================================================
//  Protocol
// =====================================================================
static void sendLine(const String& line) {
  if (!gConnected || gTxChar == nullptr) return;
  String out = line + "\n";
  // ATOMIC notify: pass the payload directly so each call captures its
  // own bytes. The two-step setValue() + notify() form races on the
  // characteristic's internal buffer when called back-to-back from
  // sendCfg() — NimBLE's async host task can read the buffer AFTER a
  // newer setValue has overwritten it, collapsing several queued
  // notifications into the last one. Symptom on rxy: only CFGEND
  // arrives, everything in between vanishes, JSON.parse('') fails.
  gTxChar->notify((const uint8_t*)out.c_str(), out.length());
}

static void sendCfg() {
  sendLine("CFGBEGIN");
  const char* p   = LAYOUT_CFG_BASE64;
  const size_t n  = strlen(p);
  const size_t CHUNK = 18;  // matches the official rxy MakeCode template
  for (size_t i = 0; i < n; i += CHUNK) {
    String line = "CFG ";
    for (size_t j = 0; j < CHUNK && (i + j) < n; ++j) line += p[i + j];
    sendLine(line);
    delay(15);  // pace notifications so the BLE stack does not drop any
  }
  sendLine("CFGEND");
  Serial.println("[BLE] Sent CFG");
}

// Dump every piece of state we know about — build info, runtime info,
// BLE state, and the current LAYOUT_CFG_BASE64 (in the same framing
// it is sent over BLE). Called from the button handler. A single
// press gives you a complete snapshot of the firmware at that moment.
static void printAllConfig() {
  // -------- Chip / build --------
  esp_chip_info_t chip;
  esp_chip_info(&chip);

  Serial.println();
  Serial.println("=================== STATE DUMP ===================");
  Serial.printf("[BUILD ] firmware     : Micro:bit Remote — ESP32\n");
  Serial.printf("[BUILD ] compiled     : %s %s\n", __DATE__, __TIME__);
  Serial.printf("[CHIP  ] model        : %d  cores=%u  rev=%u  features=0x%08lx\n",
                (int)chip.model, chip.cores, chip.revision,
                (unsigned long)chip.features);
  Serial.printf("[CHIP  ] sdk_version  : %s\n", esp_get_idf_version());
  Serial.printf("[CHIP  ] arduino_core : %d.%d.%d\n",
                ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR,
                ESP_ARDUINO_VERSION_PATCH);
  Serial.printf("[CHIP  ] cpu_mhz      : %lu\n",
                (unsigned long)getCpuFrequencyMhz());
  Serial.printf("[FLASH ] size         : %lu bytes\n",
                (unsigned long)ESP.getFlashChipSize());
  Serial.printf("[FLASH ] sketch       : %lu / %lu bytes (free %lu)\n",
                (unsigned long)ESP.getSketchSize(),
                (unsigned long)(ESP.getSketchSize() + ESP.getFreeSketchSpace()),
                (unsigned long)ESP.getFreeSketchSpace());

